{
    "personal_info": {
        "first_name": "Ludwig",
        "last_name": "Mejía Alba",
        "email": "ludwig.sleep.ma@gmail.com",
        "phone": "+57 3236148987",
        "location": {
            "country": "Colombia",
            "city": "Bogotá",
            "state": ""
        },
        "linkedin": "",
        "website": "",
        "portfolio": "",
        "summary": "Soy un profesional con amplia experiencia en el área de control de calidad y pruebas de software. Durante mi paso por Stefanini Group, desempeñé el rol de Analista de Pruebas, donde aplicaba mis conocimientos técnicos en análisis y desarrollo de sistemas de información, así como mis habilidades en programación orientada a objetos, pruebas de API y automatización de pruebas, para garantizar el óptimo desempeño de las aplicaciones. En la actualidad, busco un puesto como Analista de Calidad en un entorno ágil, donde pueda aplicar mis competencias en automatización y continuar desarrollándome profesionalmente en un ambiente de aprendizaje constante y proyectos innovadores."
    },
    "work_experience": [
        {
            "job_title": "QA Tester",
            "company": "Stefanini Group",
            "location": "",
            "start_date": "2023-02-01",
            "end_date": "2025-02-28",
            "currently_working": false,
            "responsibilities": [
                "Diseñar los casos de prueba a partir de los requerimientos detallados del cliente.",
                "Gestionar los pendientes encontrados durante la ejecución de los escenarios de prueba.",
                "Mantener actualizado el repositorio con los registros del proceso de pruebas para el proyecto.",
                "Ejecutar las actividades del proceso de control de calidad del área de pruebas, con revisiones cruzadas entre analistas y control de calidad.",
                "Dejar evidencia del resultado de las pruebas.",
                "Apoyar al equipo del proyecto en actividades relacionadas con pruebas, buscando la entrega de productos de calidad y de forma oportuna.",
                "Colaborar con la documentación del proyecto que le sea asignada.",
                "Desarrollar actividades relacionadas con el proceso de pruebas.",
                "Contribuir al mejoramiento continuo de los procesos en los que participa.",
                "Cumplir con los mandamientos de la organización.",
                "Garantizar la realización de evaluaciones iniciales y de desempeño.",
                "Cumplir con las demás funciones asignadas según su rol."
            ],
            "achievements": [],
            "repository_url": ""
        }
    ],
    "education": [
        {
            "degree": "Ingeniería de Sistemas",
            "institution": "Corporacion Unificada Nacional de Educacion Superior",
            "location": "",
            "start_date": "2023-11-01",
            "end_date": "",
            "hours": 0
        },
        {
            "degree": "Tecnólogo, Análisis y Desarrollo de Sistemas de Información",
            "institution": "Servicio Nacional de Aprendizaje - SENA",
            "location": "",
            "start_date": "2021-06-01",
            "end_date": "2023-07-31",
            "hours": 0
        }
    ],
    "skills": {
        "keywords": {
            "technical": [],
            "soft": [
                "atención-al-detalle",
                "pensamiento-crítico",
                "resolución-de-problemas",
                "trabajo-en-equipo",
                "comunicación-asertiva"
            ],
            "tools": [
                "cypress",
                "selenium",
                "postman",
                "azure-devops"
            ]
        },
        "detailed": {
            "technical": {},
            "soft": {},
            "tools": {}
        }
    },
    "certifications": [],
    "projects": [],
    "languages": [
        {
            "language": "Inglés",
            "proficiency": "Básico B1"
        }
    ],
    "volunteer_experience": [],
    "publications": [],
    "references": []
}