{
    "personal_info": {
        "first_name": "Diana Marcela",
        "last_name": "Sarmiento Valencia",
        "email": "franco.lencionijacome@gmail.com",
        "phone": "+573202552292",
        "location": {
            "country": "Colombia",
            "city": "Cali",
            "state": "Valle del Cauca"
        },
        "linkedin": "",
        "website": "",
        "portfolio": "",
        "summary": "Comunicadora social enfocada en el área de investigación de mercados. Experiencia en formulación de preguntas para recopilación de información en diferentes temas orientados al enfoque comercial. Profesional cálida al trato con valores éticos sólidos bien forjados."
    },
    "work_experience": [
        {
            "job_title": "Asesora de Comunicación y Content Creator",
            "company": "Vanita Beauty Makeup",
            "location": "",
            "start_date": "2024-03-01",
            "end_date": "2024-12-31",
            "currently_working": false,
            "responsibilities": [
                "Estudio de tendencias en redes sociales asociadas a los productos de la marca.",
                "Análisis del contenido más visualizado en redes sociales de acuerdo a los productos ofrecidos relacionados con la marca.",
                "Seguimiento y evaluación comparativa mes a mes de los KPIs de la marca de acuerdo al objetivo de marketing específico.",
                "Asesoramiento y propuestas de contenido para generar comunidad en redes a través de la propuesta de marketing orgánico."
            ],
            "achievements": [],
            "repository_url": ""
        },
        {
            "job_title": "Diseñadora de Contenidos Audiovisuales",
            "company": "CHRISTUS SINERGIA Salud",
            "location": "Cali, Valle del Cauca, Colombia",
            "start_date": "2021-05-01",
            "end_date": "2024-02-28",
            "currently_working": false,
            "responsibilities": [
                "Análisis de contenido relacionado con el área de la salud en redes sociales.",
                "Benchmarking asociado al sector salud en Cali.",
                "Elaboración de entrevistas para creación de contenido.",
                "Creación y difusión de información a través de redes sociales.",
                "Creación de tutoriales para procesos relacionados con facturación de planillas para prestadores de servicios de las clínicas.",
                "Creación de tutoriales de orientación a pacientes para acceder a plataformas web de resultados de exámenes médicos.",
                "Creación de tutoriales para personal operario de las clínicas sobre buenas prácticas en higiene de manos y desinfección.",
                "Propuestas de reels, vídeos cortos divertidos para enganchar audiencia bajo temáticas relacionadas con el sector salud."
            ],
            "achievements": [],
            "repository_url": ""
        },
        {
            "job_title": "Encuestadora e investigadora",
            "company": "Universidad del Valle",
            "location": "Cali, Valle del Cauca, Colombia",
            "start_date": "2022-05-01",
            "end_date": "2022-12-31",
            "currently_working": false,
            "responsibilities": [
                "Formulación de objetivos de investigación relacionados con temas de: orientación sexual, género y violencias basadas en género.",
                "Formulación de preguntas para elaboración de entrevistas de tipo cualitativas.",
                "Análisis de información de índole cualitativo y cuantitativo.",
                "Identificación de hallazgos y propuestas de hipótesis.",
                "Manejo de información sensible.",
                "Elaboración de informe final con conclusiones y recomendaciones."
            ],
            "achievements": [],
            "repository_url": ""
        },
        {
            "job_title": "Administrativo de apoyo",
            "company": "Vicerrectoría Académica Univalle",
            "location": "Cali, Valle del Cauca, Colombia",
            "start_date": "2016-05-01",
            "end_date": "2019-09-30",
            "currently_working": false,
            "responsibilities": [
                "Atención y orientación a profesores, estudiantes y público en general.",
                "Apoyo de archivo: organización y eliminación correcta de diferentes tipos de documentos.",
                "Sistematización de encuestas de: profesores, estudiantes, personal administrativo y personal operario de los diferentes programas académicos.",
                "Revisión de ortografía y corrección de estilo de los informes finales de Registro Calificado y Acreditación."
            ],
            "achievements": [],
            "repository_url": ""
        }
    ],
    "education": [
        {
            "degree": "Comunicación Social y Periodismo",
            "institution": "Univalle",
            "location": "Cali, Colombia",
            "start_date": "2017-01-01",
            "end_date": "2022-12-31",
            "hours": 0
        },
        {
            "degree": "Tecnología en Desarrollo de Software",
            "institution": "Univalle",
            "location": "Cali, Colombia",
            "start_date": "2022-01-01",
            "end_date": "",
            "hours": 0
        }
    ],
    "skills": {
        "keywords": {
            "technical": [],
            "soft": [],
            "tools": []
        },
        "detailed": {
            "technical": [],
            "soft": []
        }
    },
    "certifications": [],
    "projects": [],
    "languages": [],
    "volunteer_experience": [],
    "publications": [],
    "references": []
}