{
    "personal_info": {
        "first_name": "Miguel",
        "last_name": "Olivero",
        "email": "migueloliveropazos@gmail.com",
        "phone": "+34 623550130",
        "location": {
            "country": "",
            "city": "",
            "state": ""
        },
        "linkedin": "",
        "website": "",
        "portfolio": "",
        "summary": "Más de un año de experiencia con Javascript, React y Next. Me considero una persona práctica, autodidacta y capaz de superar cualquier desafío. Estoy buscando una posición que me ayude a crecer profesionalmente y seguir formándome aun más en este apasionante mundo. Me encuentro abierto a incorporar nuevas tecnologías y perfeccionar aún más en aquellas en las que tengo conocimiento."
    },
    "work_experience": [],
    "education": [],
    "skills": {
        "keywords": {
            "technical": ["wordpress", "javascript", "typescript", "bootstrap", "tailwind", "react", "next-js", "mongo-db", "node-js"],
            "soft": [],
            "tools": []
        },
        "detailed": {
            "technical": {},
            "soft": {}
        }
    },
    "certifications": [],
    "projects": [
        {
            "name": "Sneakers",
            "description": "E-commerce: Se buscó lograr un sitio web atractivo y fácil de usar, que permita a los clientes explorar una amplia gama de productos, navegar por diferentes categorías, agregar artículos al carrito de compras, realizar pagos de forma segura y recibir confirmaciones de compra. Proyecto de manera independiente.",
            "technologies": [],
            "url": ""
        },
        {
            "name": "Little",
            "description": "Portfolio de agencia de diseño: Me enfoqué en diseñar un sistema funcional, intuitivo y eficiente que permitiera a los usuarios realizar todas las tareas de manera sencilla y rápida. Logrando implementar todas las funcionalidades solicitadas enriqueciendo la experiencia del usuario. Proyecto de manera independiente.",
            "technologies": [],
            "url": ""
        },
        {
            "name": "Chimichurri",
            "description": "Web coorporativa: Landing page bien diseñada y optimizada para ser una poderosa herramienta de marketing para un restaurante, ayudando a atraer nuevos clientes, y promocionar los platos y servicios del establecimiento. Proyecto de manera independiente.",
            "technologies": [],
            "url": ""
        }
    ],
    "languages": [],
    "volunteer_experience": [],
    "publications": [],
    "references": [
        {
            "name": "Kimi Olivero",
            "relationship": "",
            "contact": ""
        }
    ]
}