{
    "personal_info": {
        "first_name": "Agustin",
        "last_name": "Aguirres",
        "email": "aguirres9797@gmail.com",
        "phone": "351 7337 941",
        "location": {
            "country": "Argentina",
            "city": "Alta Córdoba",
            "state": "Córdoba"
        },
        "linkedin": "",
        "website": "",
        "portfolio": "",
        "summary": "Desarrollador web con más de 4 años de experiencia en la creación de sistemas de booking, e-commerce y aplicaciones personalizadas. Experto en tecnologías como React, React-Native, Angular, Firebase, Tailwind, Git/GitHub/GitLab, y metodologías ágiles. He liderado equipos multidisciplinarios, planificado y llevado a producción proyectos complejos, y brindado soporte técnico para garantizar la satisfacción del cliente. Mi enfoque combina habilidades técnicas sólidas con una excelente comunicación y capacidad para resolver problemas."
    },
    "work_experience": [
        {
            "job_title": "Cofundador y Desarrollador Full Stack",
            "company": "Tudu-Num",
            "location": "",
            "start_date": "2025-01-20",
            "end_date": "",
            "currently_working": true,
            "responsibilities": [
                "Desarrollo de soluciones digitales personalizadas (booking, e-commerce, web y apps) para diversos comercios.",
                "Uso de tecnologías como React, React-Native, Firebase, Tailwind, Bootstrap, Git/GitHub/GitLab.",
                "Soporte técnico y comunicación directa con clientes para mejorar productos basado en feedback.",
                "Liderazgo en la planificación y ejecución de proyectos, garantizando entregas a tiempo y con alta calidad."
            ],
            "achievements": [],
            "repository_url": ""
        },
        {
            "job_title": "Desarrollador Web Full Stack",
            "company": "EventPro",
            "location": "StartUp, España",
            "start_date": "2024-01-01",
            "end_date": "2024-12-31",
            "currently_working": false,
            "responsibilities": [
                "Desarrollo de aplicaciones para eventos multitudinarios utilizando Angular, Ionic, MaterialUI, Firebase, GitLab y Jira.",
                "Colaboración en equipos interdisciplinarios, aplicando metodologías ágiles.",
                "Mejora de la experiencia del usuario y optimización de procesos internos."
            ],
            "achievements": [],
            "repository_url": ""
        },
        {
            "job_title": "Desarrollador Web Full Stack",
            "company": "RanDev",
            "location": "StartUp",
            "start_date": "2022-01-01",
            "end_date": "2024-12-31",
            "currently_working": false,
            "responsibilities": [
                "Desarrollo de sistemas de booking, e-commerce y aplicaciones personalizadas.",
                "Planificación, diseño y liderazgo de proyectos desde su concepción hasta su puesta en producción.",
                "Soporte técnico y comunicación con clientes para resolver problemas y mejorar productos."
            ],
            "achievements": [],
            "repository_url": ""
        },
        {
            "job_title": "Atención al Cliente y Logística",
            "company": "Soluciones Descartables SRL",
            "location": "",
            "start_date": "2016-01-01",
            "end_date": "2022-12-31",
            "currently_working": false,
            "responsibilities": [
                "Lideré equipos de más de 8 personas, asignando tareas, supervisando desempeño y fomentando un ambiente de trabajo colaborativo.",
                "Responsable de la planificación y ejecución de la logística de almacén, incluyendo la recepción, organización y distribución de mercancías.",
                "Brindé atención personalizada a clientes, resolviendo consultas y gestionando reclamos.",
                "Implementé un sistema de organización de depósito que redujo los errores de inventario en un 25%, utilizando herramientas básicas de software y planificación manual."
            ],
            "achievements": [],
            "repository_url": ""
        }
    ],
    "education": [],
    "skills": {
        "keywords": {
            "technical": [
                "javascript", 
                "react", 
                "react-native", 
                "angular", 
                "ionic",
                "tailwind", 
                "bootstrap", 
                "materialui", 
                "firebase", 
                "git", 
                "github", 
                "gitlab"
            ],
            "soft": [
                "comunicación-efectiva",
                "liderazgo",
                "resolución-de-problemas",
                "adaptabilidad",
                "trabajo-bajo-presión"
            ],
            "tools": [
                "insomnia",
                "jira",
                "figma",
                "postman"
            ]
        },
        "detailed": {
            "technical": {},
            "soft": {}
        }
    },
    "certifications": [],
    "projects": [],
    "languages": [],
    "volunteer_experience": [],
    "publications": [],
    "references": []
}