{
  "personal_info": {
    "first_name": "Manuel",
    "last_name": "Freitas",
    "email": "freitas.manuel@gmail.com",
    "phone": "",
    "location": {
      "country": "Venezuela",
      "city": "Maracaibo",
      "state": "Zulia"
    },
    "linkedin": "www.linkedin.com/in/freitasmanuel",
    "website": "",
    "portfolio": "",
    "summary": "Ingeniero de Sistemas con más de 34 años de experiencia en el desarrollo de software para la industria del petróleo y gas, aplicando técnicas avanzadas en optimización matemática, estadística, simulación e inteligencia artificial. Me describo como una persona con perfil técnico-científico, con gran interés en la investigación y en la innovación para abordar y resolver problemas complejos de manera efectiva."
  },
  "work_experience": [
    {
      "job_title": "Consultor Senior TI/Ing. Sistemas",
      "company": "Profesional Independiente",
      "location": "",
      "start_date": "2012-01-01",
      "end_date": "",
      "currently_working": true,
      "responsibilities": [
        "Prestar servicios de consultoría TI en la planificación, desarrollo, implementación y mantenimiento de soluciones tecnológicas.",
        "Desarrollo de Software basado en: Optimización matemática, Modelos Probabilísticos, Simulación, Métodos Numéricos, Inteligencia Artificial, Gerencia de la Incertidumbre, Ing. de Confiabilidad y Análisis de Riesgo, para la solución de problemas complejos.",
        "Diseñar e implementar Algoritmos de Optimización (Programación Lineal, No Lineal, Entera, Combinatoria, Estocástica, Metaheurísticas).",
        "Amplia experiencia con Excel avanzado: Análisis de Datos, automatización de procesos, generación de reportes, dashboards, tablas dinámicas, bases de datos, complementos (plugins) en .NET.",
        "Programar en Python, R, Julia, JavaScript, Java, C++, C#, .Net, Excel VBA, SQL."
      ],
      "achievements": [],
      "repository_url": ""
    },
    {
      "job_title": "Líder en Optimización Matemática",
      "company": "Cayros",
      "location": "",
      "start_date": "2023-01-01",
      "end_date": "2024-12-31",
      "currently_working": false,
      "responsibilities": [
        "Asistir al Equipo de Desarrollo de Productos Cloud en el diseño, creación e implementación de Modelos de Optimización.",
        "Generación e implementación de rutinas de optimización en C-Fields.",
        "Modelado y optimización para la programación de producción de pozos petroleros.",
        "Programar en Javascript, Python y VBA Excel."
      ],
      "achievements": [],
      "repository_url": ""
    },
    {
      "job_title": "Director Unidad de Sistemas",
      "company": "R2M Mexico, SA de CV",
      "location": "",
      "start_date": "2003-08-01",
      "end_date": "2011-12-31",
      "currently_working": false,
      "responsibilities": [
        "Aportar un mayor conocimiento de las últimas tecnologías a la Empresa.",
        "Colaborar en la evaluación de distintas alternativas tecnológicas y participar en la validación y selección de la solución más adecuada para los sistemas a desarrollar e implantar.",
        "Ofrecer una opinión experta, pericia o conocimientos relativos a los requisitos del negocio, que han de tenerse en cuenta en el desarrollo de un sistema de información.",
        "Dar una visión más precisa de la tecnología existente en la actualidad en la organización o que se evalúa incorporar.",
        "Contactar clientes potenciales y desarrollar nuevas áreas de negocio.",
        "Mantener vigente y operativa la plataforma tecnológica de la empresa."
      ],
      "achievements": [],
      "repository_url": ""
    },
    {
      "job_title": "Consultor asociado para el desarrollo de herramientas Computacionales en el área de Ing. Confiabilidad",
      "company": "R2M Mexico, SA de CV",
      "location": "",
      "start_date": "2003-08-01",
      "end_date": "2011-12-31",
      "currently_working": false,
      "responsibilities": [
        "Diseñar y desarrollar herramientas computacionales en el área de Ingeniería de Confiabilidad y Gerencia del Riesgo.",
        "Asesorar a clientes en el diseño de soluciones informáticas y computacionales adecuadas a sus necesidades.",
        "Asesor Senior en Diseño y desarrollo de herramientas computacionales para el área de Ingeniería de Confiabilidad y Gerencia del Riesgo.",
        "Asesor Senior en Optimización de Portafolio de Activos en la Industria de Hidrocarburos aplicando Análisis Probabilístico de Riesgo en los trabajos de Perforación y Reparación de Pozos.",
        "Asesor Senior para Proyectos de Desarrollo de software en el área de Confiabilidad.",
        "Asesor Senior para Proyectos de Optimización de Portafolio."
      ],
      "achievements": [],
      "repository_url": ""
    },
    {
      "job_title": "Profesional I - Departamento Construcción y Mantenimiento",
      "company": "PDVSA - Intevep, S.A",
      "location": "",
      "start_date": "1991-04-01",
      "end_date": "2003-01-31",
      "currently_working": false,
      "responsibilities": [
        "Desarrollo de Simuladores técnicos especializados en el área de Mecánica de Perforación y Rehabilitación de Pozos.",
        "Desarrollo de una metodología de Análisis de Riesgo en Perforación y Rehabilitación de Pozos con aplicación en PDVSA-Occidente.",
        "Asesor del grupo VCD Perforación de PDVSA-Occidente en la implementación de la Metodología Análisis de Riesgos en Perforación (QRA).",
        "Aplicación de Inteligencia Tecnológica y Gerencia del Conocimiento (Benchmarking), para la evaluación e incorporación de nuevas tecnologías.",
        "Asignación en PDVSA E&P – Occidente para la evaluación e incorporación de nuevas tecnologías.",
        "Líder de proyecto para el desarrollo del sistema SISPYR ©.",
        "Coordinador de Requerimientos de Informática para la Gerencia EPCP.",
        "Instructor del Curso 'Análisis de Riesgo en Perforación'.",
        "Tutor de Tesistas/Pasantes."
      ],
      "achievements": [],
      "repository_url": ""
    }
  ],
  "education": [
    {
      "degree": "Diplomado Internacional en Ingeniería de Confiabilidad",
      "institution": "Universidad Tecnologica de Tabasco",
      "location": "",
      "start_date": "2005-01-01",
      "end_date": "2005-12-31",
      "hours": 0
    },
    {
      "degree": "Ingeniero de Sistemas",
      "institution": "Instituto Universitario Politecnico Santiago Mariño",
      "location": "",
      "start_date": "",
      "end_date": "2000-01-01",
      "hours": 0
    },
    {
      "degree": "Técnico Superior en Informática",
      "institution": "Instituto Universitario de Tecnologia Isaac Newton",
      "location": "",
      "start_date": "",
      "end_date": "1991-01-01",
      "hours": 0
    }
  ],
  "skills": {
    "keywords": {
      "technical": [
        "python",
        "r",
        "julia",
        "javascript",
        "java",
        "c++",
        "c#",
        ".net",
        "excel-vba",
        "sql"
      ],
      "soft": [
        "problem-solving",
        "innovative-thinking",
        "research"
      ],
      "tools": []
    },
    "detailed": {
      "technical": {
        "optimization-mathematics": [
          {
            "name": "Lineal, No Lineal, Entera, Combinatoria, Estocástico, Metaheurísticas",
            "repository_url": ""
          }
        ],
        "data-analysis": [
          {
            "name": "Analysis & Visualization with Excel VBA, PowerBI",
            "repository_url": ""
          }
        ],
        "artificial-intelligence": [
          {
            "name": "Machine Learning, Deep Learning, AI Agents, LLM",
            "repository_url": ""
          }
        ]
      }
    }
  },
  "certifications": [],
  "projects": [
    {
      "name": "MDA-RN",
      "description": "Modelo de Aproximación basado en Redes Neuronales para generar Pronósticos de Producción Probabilista a partir de Modelos de Simulación.",
      "technologies": [],
      "url": ""
    },
    {
      "name": "MOPI",
      "description": "Modelo de Optimización de Portafolio de Inversiones.",
      "technologies": [],
      "url": ""
    },
    {
      "name": "SSOIP",
      "description": "Secuencia Óptima de Intervenciones a Pozos.",
      "technologies": [],
      "url": ""
    },
    {
      "name": "Risk Project",
      "description": "Cálculo de Incertidumbre de Tiempos y Costos en Proyectos.",
      "technologies": [],
      "url": ""
    }
  ],
  "languages": [
    {
      "language": "Español",
      "proficiency": "Nativo"
    },
    {
      "language": "Inglés",
      "proficiency": "Técnico, básico"
    }
  ],
  "volunteer_experience": [],
  "publications": [
    {
      "title": "Modelo de Aproximación basado en Redes Neuronales para generar Pronósticos de Producción Probabilista a partir de Modelos de Simulación Numérica de Yacimientos - MDA_RN",
      "publisher": "R2M México",
      "publication_date": "2020-12-01",
      "url": ""
    },
    {
      "title": "Metodología de Optimización de Secuencia de Intervenciones a Pozos",
      "publisher": "Simposio Ibero-Americano de Aplicaciones y Tecnologías de Información y Comunicaciones",
      "publication_date": "2012-11-01",
      "url": ""
    }
  ],
  "references": []
}