{
    "personal_info": {
        "first_name": "Francisco",
        "last_name": "Batalla",
        "email": "franciscobatalla23@hotmail.com",
        "phone": "5582031776",
        "location": {
            "country": "Mexico",
            "city": "",
            "state": "Estado de Mexico"
        },
        "linkedin": "",
        "website": "",
        "portfolio": "",
        "summary": "Soy desarrollador de software y desarrollador web con una sólida base en programación orientada a objetos, gestión de bases de datos y diseño UX/UI. A lo largo de mi trayectoria, he trabajado en diversos proyectos utilizando tecnologías como PHP, Python, HTML, CSS, JavaScript, principios de NodeJS y gestores de bases de datos como MySQL y SQL Server. Me apasiona enfrentar nuevos desafíos y encontrar soluciones eficientes para cada proyecto, siempre con un enfoque en la usabilidad y la experiencia del usuario. Mi objetivo es crear aplicaciones funcionales, intuitivas y optimizadas, asegurando siempre la mejor experiencia para el cliente final."
    },
    "work_experience": [
        {
            "job_title": "Empleado",
            "company": "Publiscan",
            "location": "Estado de México",
            "start_date": "2022-12-01",
            "end_date": "2023-04-30",
            "currently_working": false,
            "responsibilities": [
                "Presté mis servicios como un empleado amable, trabajador y responsable en una oficina, donde atendí a los correos y llamadas entrantes de los clientes.",
                "Trabajé de diseñador elaborando tarjetas de presentación y formatos proporcionados por la oficina.",
                "Actué con una gran ética del trabajo, profesionalidad y capacidad para trabajar bajo presión."
            ],
            "achievements": [],
            "repository_url": ""
        },
        {
            "job_title": "Becario Desarrollo de software",
            "company": "",
            "location": "Tlalnepantla de Baz, Estado de México",
            "start_date": "2024-02-01",
            "end_date": "2024-09-30",
            "currently_working": false,
            "responsibilities": [
                "Desarrollo de plataforma de ecommerce para la Central de Abastos de Ecatepec (CEDA).",
                "Liderazgo en el desarrollo de una aplicación web alojada en SiteGround.",
                "Implementación de tecnologías como PHP, HTML, CSS, Python y gestión de bases de datos con PhpMyAdmin.",
                "Organización semanal de visitas a la CEDA para la carga y gestión de productos de locatarios.",
                "Diseño de una experiencia de usuario optimizada mediante la categorización específica de productos.",
                "Colaboración con el equipo de desarrollo para asegurar la correcta integración y funcionalidad del ecommerce."
            ],
            "achievements": [],
            "repository_url": ""
        },
        {
            "job_title": "Traine de Desarrollo Web",
            "company": "",
            "location": "Santa Rosa de Lima, Estado de México",
            "start_date": "2023-08-01",
            "end_date": "2024-02-29",
            "currently_working": false,
            "responsibilities": [
                "Área de Hardware: Mantenimiento de equipos móviles, computadoras, impresoras y escáneres.",
                "Optimización de la red de cableado para mejorar el flujo de internet entre equipos.",
                "Área de Desarrollo Web (Backend/Frontend): Creación de un punto de venta ecommerce con funcionalidades avanzadas como carrusel de productos.",
                "Áreas dinámicas para mejorar la experiencia del usuario (UX).",
                "Integración de una base de datos para el registro de usuarios y gestión de compras.",
                "Supervisión de equipos de desarrollo web y software.",
                "Desarrollo y automatización de planes de pruebas para aplicaciones web.",
                "Investigación y evaluación de nuevas tecnologías para optimizar soluciones de software.",
                "Diseño y desarrollo de páginas web rápidas, adaptables y funcionales.",
                "Participación en el desarrollo y mantenimiento de sitios web fáciles de usar."
            ],
            "achievements": [],
            "repository_url": ""
        },
        {
            "job_title": "Soporte en Sistemas",
            "company": "",
            "location": "Tultitlán de Mariano Escobedo, Estado de México",
            "start_date": "2024-10-01",
            "end_date": "2024-12-31",
            "currently_working": false,
            "responsibilities": [
                "Soporte a equipos de cómputo e impresoras.",
                "Mantenimiento de dispositivos biométricos en distintas áreas del almacén.",
                "Envío de reportes semanales sobre los procesos implementados."
            ],
            "achievements": [],
            "repository_url": ""
        }
    ],
    "education": [
        {
            "degree": "Ingeniero en Sistemas Computacionales",
            "institution": "Tecnologico de Estudios Superiores de Cuautitlan Izcalli",
            "location": "Estado de México",
            "start_date": "2020-09-01",
            "end_date": "2025-02-28",
            "hours": 0
        }
    ],
    "skills": {
        "keywords": {
            "technical": ["php", "python", "html", "css", "javascript", "nodejs", "mysql", "sql-server"],
            "soft": [
                "trabajo-en-equipo",
                "trato-con-personas",
                "responsabilidad",
                "liderazgo",
                "habilidades-comunicativas",
                "resolución-de-problemas",
                "adaptabilidad",
                "capacidad-de-aprendizaje"
            ],
            "tools": []
        },
        "detailed": {}
    },
    "certifications": [],
    "projects": [],
    "languages": [
        {
            "language": "English",
            "proficiency": "Beginner"
        }
    ],
    "volunteer_experience": [],
    "publications": [],
    "references": []
}